🚀&nbsp; env0 had composed a PR Plan for environment [ci-demo / full-web-app-testing ](https://app.env0.com/p/6075aa75-c364-496d-af7c-f6584486cb03/environments/fd4da88e-3b7c-49ce-beed-234b0f25d3b7):
```
Plan: 8 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # azurerm_linux_virtual_machine.main[0] will be created
+   resource "azurerm_linux_virtual_machine" "main" {
+       admin_password                  = (sensitive value)
+       admin_username                  = "tacoadmin"
+       allow_extension_operations      = true
+       computer_name                   = "testingtestingapp"
+       custom_data                     = (sensitive value)
+       disable_password_authentication = false
+       extensions_time_budget          = "PT1H30M"
+       id                              = (known after apply)
+       location                        = "eastus"
+       max_bid_price                   = -1
+       name                            = "testingtestingapp-0"
+       network_interface_ids           = (known after apply)
+       patch_assessment_mode           = "ImageDefault"
+       patch_mode                      = "ImageDefault"
+       platform_fault_domain           = -1
+       priority                        = "Regular"
+       private_ip_address              = (known after apply)
+       private_ip_addresses            = (known after apply)
+       provision_vm_agent              = true
+       public_ip_address               = (known after apply)
+       public_ip_addresses             = (known after apply)
+       resource_group_name             = "testingtestingapp"
+       size                            = "Standard_D2s_v5"
+       tags                            = {
+           "BusinessUnit"        = "taco"
+           "Environment"         = "testing"
+           "Organization"        = "taco-co"
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
+       virtual_machine_id              = (known after apply)

+       os_disk {
+           caching                   = "ReadWrite"
+           disk_size_gb              = (known after apply)
+           name                      = (known after apply)
+           storage_account_type      = "Standard_LRS"
+           write_accelerator_enabled = false
        }

+       source_image_reference {
+           offer     = "UbuntuServer"
+           publisher = "Canonical"
+           sku       = "18.04-LTS"
+           version   = "latest"
        }

+       termination_notification {
+           enabled = (known after apply)
+           timeout = (known after apply)
        }
    }


  # azurerm_network_interface.main[0] will be created
+   resource "azurerm_network_interface" "main" {
+       applied_dns_servers           = (known after apply)
+       dns_servers                   = (known after apply)
+       enable_accelerated_networking = false
+       enable_ip_forwarding          = false
+       id                            = (known after apply)
+       internal_dns_name_label       = (known after apply)
+       internal_domain_name_suffix   = (known after apply)
+       location                      = "eastus"
+       mac_address                   = (known after apply)
+       name                          = "testingtestingapp-0"
+       private_ip_address            = (known after apply)
+       private_ip_addresses          = (known after apply)
+       resource_group_name           = "testingtestingapp"
+       tags                          = {
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
+       virtual_machine_id            = (known after apply)

+       ip_configuration {
+           gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
+           name                                               = "testingNICConfg"
+           primary                                            = (known after apply)
+           private_ip_address                                 = (known after apply)
+           private_ip_address_allocation                      = "Dynamic"
+           private_ip_address_version                         = "IPv4"
+           public_ip_address_id                               = (known after apply)
+           subnet_id                                          = (known after apply)
        }
    }


  # azurerm_network_security_group.main will be created
+   resource "azurerm_network_security_group" "main" {
+       id                  = (known after apply)
+       location            = "eastus"
+       name                = "testingtestingapp"
+       resource_group_name = "testingtestingapp"
+       security_rule       = (known after apply)
+       tags                = {
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
    }

  # azurerm_network_security_rule.app will be created
+   resource "azurerm_network_security_rule" "app" {
+       access                      = "Allow"
+       destination_address_prefix  = "*"
+       destination_port_range      = "8000"
+       direction                   = "Inbound"
+       id                          = (known after apply)
+       name                        = "App"
+       network_security_group_name = "testingtestingapp"
+       priority                    = 1001
+       protocol                    = "Tcp"
+       resource_group_name         = "testingtestingapp"
+       source_address_prefix       = "*"
+       source_port_range           = "*"
    }


  # azurerm_public_ip.main[0] will be created
+   resource "azurerm_public_ip" "main" {
+       allocation_method       = "Dynamic"
+       domain_name_label       = "testingtestingapp-0"
+       fqdn                    = (known after apply)
+       id                      = (known after apply)
+       idle_timeout_in_minutes = 4
+       ip_address              = (known after apply)
+       ip_version              = "IPv4"
+       location                = "eastus"
+       name                    = "testingtestingapp-0"
+       resource_group_name     = "testingtestingapp"
+       sku                     = "Basic"
+       sku_tier                = "Regional"
+       tags                    = {
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
    }


  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "testingtestingapp"
+       tags     = {
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
    }

  # azurerm_subnet.main["appnet"] will be created
+   resource "azurerm_subnet" "main" {
+       address_prefixes                               = [
+           "10.42.0.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = (known after apply)
+       enforce_private_link_service_network_policies  = (known after apply)
+       id                                             = (known after apply)
+       name                                           = "appnet"
+       private_endpoint_network_policies_enabled      = (known after apply)
+       private_link_service_network_policies_enabled  = (known after apply)
+       resource_group_name                            = "testingtestingapp"
+       virtual_network_name                           = "testingtestingapp"
    }


  # azurerm_virtual_network.main will be created
+   resource "azurerm_virtual_network" "main" {
+       address_space       = [
+           "10.42.0.0/16",
        ]
+       dns_servers         = (known after apply)
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "eastus"
+       name                = "testingtestingapp"
+       resource_group_name = "testingtestingapp"
+       subnet              = (known after apply)
+       tags                = {
+           "env0_environment_id" = "fd4da88e-3b7c-49ce-beed-234b0f25d3b7"
+           "env0_project_id"     = "6075aa75-c364-496d-af7c-f6584486cb03"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_url = [
+       (known after apply),
    ]
```
</details>


```
Monthly cost change for ned1313/env0-ci-example/.tf-plan
Amount:  +$71.62 ($0.00 → $71.62)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: ned1313/env0-ci-example/.tf-plan

+ azurerm_linux_virtual_machine.main[0]
  +$71.62

+     Instance usage (pay as you go, Standard_D2s_v5)
      +$70.08

+     os_disk
    
+         Storage (S4)
          +$1.54
    
+         Disk operations
          Monthly cost depends on usage
            +$0.0005 per 10k operations

+ azurerm_public_ip.main[0]
  $0.00

+     IP address (dynamic)
      $0.00

Monthly cost change for ned1313/env0-ci-example/.tf-plan
Amount:  +$71.62 ($0.00 → $71.62)

──────────────────────────────────
Key: ~ changed, + added, - removed

8 cloud resources were detected:
∙ 2 were estimated, 1 of which usage-based costs, see https://infracost.io/usage-file
∙ 6 were free, rerun with --show-skipped to see details
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/6075aa75-c364-496d-af7c-f6584486cb03/environments/fd4da88e-3b7c-49ce-beed-234b0f25d3b7/deployments/785a2040-05b5-42fe-8fbe-e3d82897c069)